src/Reports/ОтчетОбОкончанииСрокаКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетОбОкончанииСрокаКонтрактов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровСФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоОсновнымДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ТрудовыеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТрудовыеДоговора</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровСФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеТрудовогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипТрудовогоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипТрудовогоДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыДоговоровСФизЛицами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровСФизЛицами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контракт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авторский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорУправленческий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ОтчетОбОкончанииСрокаКонтрактов/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда
	
Функция СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)
	//Аверсон 07.01.2023 КВВ СВФР-010125 (
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДействиеТрудовогоДоговора",Перечисления.ТипТрудовогоДоговора.Заключен);
	Запрос.УстановитьПараметр("Сотрудник",ВыбСотрудник);
	Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговораСрезПоследних.НачалоДоговора,
	|	ТрудовыеДоговораСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговораСрезПоследних
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговораСрезПоследних.Сотрудник
	|ГДЕ
	|   ТрудовыеДоговораСрезПоследних.Сотрудник = &Сотрудник 
	|	И ТрудовыеДоговораСрезПоследних.ДействиеТрудовогоДоговора = &ДействиеТрудовогоДоговора
	|	И ТрудовыеДоговораСрезПоследних.ВидДоговора = &ВидДоговора";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	//Аверсон 07.01.2023 КВВ СВФР-010125 )
КонецФункции

Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокКонтракта, ДокументРезультат)
	
	//Аверсон ЕАЕ 26.08.2025 СВФР-016443
	//Климовичи
	Если Организация.ИНН = "700103211" Тогда
		мСквознаяНумерацияНомер = 0;
	КонецЕсли;
	//Аверсон СВФР-016443
	
	Пока ВыборкаСтрокКонтракта.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокКонтракта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		//Аверсон 04.03.2020 КВВ СВФР-005600 (
		Если ВыводитьПоОсновнымДоговорам Тогда
			Если ВыборкаСтрокКонтракта.Регистратор <> ВыборкаСтрокКонтракта.Сотрудник.ТрудовойДоговор Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//Аверсон 04.03.2020 КВВ СВФР-005600 )
		
		//Аверсон ЕАЕ 26.08.2025 СВФР-016443
		//Климовичи
		Если Организация.ИНН = "700103211" Тогда
			мСквознаяНумерацияНомер = мСквознаяНумерацияНомер + 1;
		КонецЕсли;
		//Аверсон СВФР-016443
		
		//Аверсон 07.01.2023 КВВ СВФР-010125 (
		ПолныхЛет = 0; Год = 0;  НачалоЗаключенногоКонтракта = Дата(1,1,1);
		ЗаключенныйКонтракт = СформируемЗапросПоЗаключенномуКонтракту(ВыборкаСтрокКонтракта.Сотрудник).Выбрать();
		Пока ЗаключенныйКонтракт.Следующий() Цикл
			НачалоЗаключенногоКонтракта = ЗаключенныйКонтракт.НачалоДоговора;
		КонецЦикла; 
		Если НачалоЗаключенногоКонтракта <> Дата(1,1,1) Тогда
			Лет = 0;   Месяцев = 0;  Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(ВыборкаСтрокКонтракта.ОкончаниеДоговора + 86400,НачалоЗаключенногоКонтракта, Лет, Месяцев, Дней);
			Если Лет < 5 Тогда
				ПолныхЛет = 5 - Лет;
			Иначе
				ПолныхЛет = 5;
			КонецЕсли;
		КонецЕсли;
		//Аверсон 07.01.2023 КВВ СВФР-010125 )
		
		Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокКонтракта.ПодразделениеОрганизации Тогда			
			мНомер = 0;
			
			//Аверсон ЕАЕ 26.08.2025 СВФР-016443
			//Климовичи
			Если Организация.ИНН <> "700103211" Тогда
			//Аверсон СВФР-016443
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
				ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокКонтракта.ПодразделениеОрганизацииКод);
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокКонтракта.ПодразделениеОрганизацииНаименование;				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			КонецЕсли;
		
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			
			//Аверсон ЕАЕ 26.08.2025 СВФР-016443
			//Климовичи
			Если Организация.ИНН = "700103211" Тогда
				ОбластьДетальныхЗаписей.Параметры.Номер = мСквознаяНумерацияНомер;	
			Иначе
				ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокКонтракта.Сотрудник.Код;
			КонецЕсли;
			//ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокКонтракта.Сотрудник.Код;	
			//Аверсон СВФР-016443
			
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокКонтракта.Сотрудник.Наименование;				
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокКонтракта.Должность;
			ОбластьДетальныхЗаписей.Параметры.ДатаКонтракта = ВыборкаСтрокКонтракта.Регистратор.ДатаТД;  //Аверсон 28.08.2019 КВВ СВФР-004690
			ОбластьДетальныхЗаписей.Параметры.НомерКонтракта = ВыборкаСтрокКонтракта.НомерТД;
			ОбластьДетальныхЗаписей.Параметры.НачалоКонтракта = ВыборкаСтрокКонтракта.НачалоДоговора;
			ОбластьДетальныхЗаписей.Параметры.ОкончаниеКонтракта = ВыборкаСтрокКонтракта.ОкончаниеДоговора;
			
			//Аверсон 07.01.2023 КВВ СВФР-010125 (
			Лет = 0;  Месяцев = 0;   Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(РабочаяДата,ВыборкаСтрокКонтракта.Сотрудник.Физлицо.ДатаРождения, Лет, Месяцев, Дней);
			ОбластьДетальныхЗаписей.Параметры.Возраст = Лет;			
			ОбластьДетальныхЗаписей.Параметры.ПродлениеКонтракта = ПолныхЛет;
			//Аверсон 07.01.2023 КВВ СВФР-010125 )
			
			//Аверсон ЕАЕ 26.08.2025 СВФР-016443
			//Климовичи
			Если Организация.ИНН = "700103211" Тогда
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизации = ВыборкаСтрокКонтракта.ПодразделениеОрганизацииНаименование;	
			КонецЕсли;
			//Аверсон СВФР-016443
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокКонтракта.ПодразделениеОрганизации;
		Иначе
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			
			//Аверсон ЕАЕ 26.08.2025 СВФР-016443
			//Климовичи
			Если Организация.ИНН = "700103211" Тогда
				ОбластьДетальныхЗаписей.Параметры.Номер = мСквознаяНумерацияНомер;
			Иначе
				ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокКонтракта.Сотрудник.Код;
			КонецЕсли;
			//ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокКонтракта.Сотрудник.Код;	
			//Аверсон СВФР-016443
			
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокКонтракта.Сотрудник.Наименование;				
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокКонтракта.Должность;
			ОбластьДетальныхЗаписей.Параметры.ДатаКонтракта = ВыборкаСтрокКонтракта.Регистратор.ДатаТД;  //Аверсон 28.08.2019 КВВ СВФР-004690
			ОбластьДетальныхЗаписей.Параметры.НомерКонтракта = ВыборкаСтрокКонтракта.НомерТД;
			ОбластьДетальныхЗаписей.Параметры.НачалоКонтракта = ВыборкаСтрокКонтракта.НачалоДоговора;
			ОбластьДетальныхЗаписей.Параметры.ОкончаниеКонтракта = ВыборкаСтрокКонтракта.ОкончаниеДоговора;
						
			//Аверсон 07.01.2023 КВВ СВФР-010125 (
			Лет = 0;  Месяцев = 0;   Дней = 0; 
			ОбщегоНазначения.РазобратьРазностьДат(РабочаяДата,ВыборкаСтрокКонтракта.Сотрудник.Физлицо.ДатаРождения, Лет, Месяцев, Дней);
			ОбластьДетальныхЗаписей.Параметры.Возраст = Лет;			
			ОбластьДетальныхЗаписей.Параметры.ПродлениеКонтракта = ПолныхЛет;
			//Аверсон 07.01.2023 КВВ СВФР-010125 )
			
			//Аверсон ЕАЕ 26.08.2025 СВФР-016443
			//Климовичи
			Если Организация.ИНН = "700103211" Тогда
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизации = ВыборкаСтрокКонтракта.ПодразделениеОрганизацииНаименование;	
			КонецЕсли;
			//Аверсон СВФР-016443
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокКонтракта.ПодразделениеОрганизации;
		КонецЕсли;
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	ТекПодр = ""; 
	
	//Аверсон ЕАЕ 26.08.2025 СВФР-016443
	//Климовичи
	Если Организация.ИНН = "700103211" Тогда
		мМакет = ПолучитьМакет("МакетОтчетаБезГруппировкиПоПодразделениям");
	Иначе
		мМакет = ПолучитьМакет("МакетОтчета");
	КонецЕсли;
	//Аверсон СВФР-016443
	
	СписокТиповТрудовогоДоговора = Новый СписокЗначений;	
	Если ПустаяСтрока(Тип) Тогда	
		СписокТиповТрудовогоДоговора.Добавить(Перечисления.ТипТрудовогоДоговора.Заключен);
		СписокТиповТрудовогоДоговора.Добавить(Перечисления.ТипТрудовогоДоговора.Продлен);
	Иначе
		СписокТиповТрудовогоДоговора = Новый СписокЗначений;
		СписокТиповТрудовогоДоговора.Добавить(Тип);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация," + 
	
	//Аверсон ЕАЕ 22.12.2021 СВФР-008520
	//Для Бобруйска: если заполнено ПодразделениеДляПечати в Подразделении - выводим Подразделение для печати,
	//если нет - Подразделение.
	
	//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод," 
	
	?(Организация.ИНН = "700067572","
	
	|	ВЫБОР 
	|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|	ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати
	|	КОНЕЦ КАК ПодразделениеОрганизации, 
	|	ВЫБОР 
	|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование
	|	ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати.Наименование
	|	КОНЕЦ КАК ПодразделениеОрганизацииНаименование,
	|	ВЫБОР 
	|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код
	|	ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати.Код
	|	КОНЕЦ КАК ПодразделениеОрганизацииКод,","
	
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,") + "
	//Аверсон СВФР-008520
	
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговора.Период,
	|	ТрудовыеДоговора.Регистратор,
	|	ТрудовыеДоговора.Сотрудник КАК Сотрудник,
	|	ТрудовыеДоговора.ВидДоговора,
	|	ТрудовыеДоговора.НомерТД,
	|	ТрудовыеДоговора.ДействиеТрудовогоДоговора,
	|	ТрудовыеДоговора.НачалоДоговора,
	|	ТрудовыеДоговора.ОкончаниеДоговора,
	|	ТрудовыеДоговора.ПроцентПоКонтракту
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период,) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговора
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговора.Сотрудник
	|ГДЕ
	|	ТрудовыеДоговора.ОкончаниеДоговора >= &НачалоПериода
	|	И ТрудовыеДоговора.ОкончаниеДоговора <= &ОкончаниеПериода
	|	И ТрудовыеДоговора.ДействиеТрудовогоДоговора В (&ДействиеТрудовогоДоговора)
	|   //И ТрудовыеДоговора.ВидДоговора = &ВидДоговора
	|   И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0	
	|   И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	Если ЗначениеЗаполнено(Подразделение) Тогда //О.Т. Аверсон 06.11.2018 № 2753
		
		//Аверсон ЕАЕ 22.12.2021 СВФР-008520
		Если Организация.ИНН = "700067572" Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|   И (ВЫБОР 
			|		КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|		ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати
			|	   КОНЕЦ) В ИЕРАРХИИ (&Подразделение)";
		Иначе
			//Аверсон СВФР-008520
			
			ТекстЗапроса = ТекстЗапроса +"
			|   И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +"	
	|УПОРЯДОЧИТЬ ПО 
	
	//Аверсон ЕАЕ 31.01.2025 СВФР-014700
	|   ТрудовыеДоговора.ОкончаниеДоговора,"
	//Аверсон СВФР-014700
	
	//Аверсон ЕАЕ 22.12.2021 СВФР-008520
	+ ?(Организация.ИНН = "700067572", "
	|	ПодразделениеОрганизацииКод,
	|	ПодразделениеОрганизацииНаименование,","
	|	ПодразделениеОрганизацииКод,
	|	ПодразделениеОрганизацииНаименование,") + "
	//Аверсон СВФР-008520
	
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("ДействиеТрудовогоДоговора",СписокТиповТрудовогоДоговора);
	Запрос.УстановитьПараметр("НачалоПериода",НачПериод);
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонПериод);
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	//О.Т. Аверсон 20.12.2015 № 765
	Если ЗначениеЗаполнено(ВидДоговора) Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ТрудовыеДоговора.ВидДоговора = &ВидДоговора","И ТрудовыеДоговора.ВидДоговора = &ВидДоговора");
	иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ТрудовыеДоговора.ВидДоговора = &ВидДоговора","");
	КонецЕсли;
	//О.Т. Аверсон 20.12.2015 № 765
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора); //О.Т. Аверсон 20.12.2015 № 765
	
	//Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	Запрос.УстановитьПараметр("Организация",      Организация);
	
	Если Не Подразделение.Пустая() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)")
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();	
	ДокументРезультат.Очистить();
	
	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");  //Аверсон 28.08.2019 КВВ СВФР-004690
	ДокументРезультат.Вывести(Область);
	
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
	
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

//Аверсон ЕАЕ 26.08.2025 СВФР-016443
//Климовичи
//мМакет = ПолучитьМакет("МакетОтчета");
//Аверсон СВФР-016443

#КонецЕсли
